app/Controllers/Cita.php

    public function add()
    {

        $doctorM = model('DoctorM');
        $data['doctor'] = $doctorM->findAll();
        $pacienteM = model('PacienteM');
        $data['paciente'] = $pacienteM->findAll();
---
SELECT *
FROM `doctor`
SELECT *
FROM `paciente`