app/Controllers/Direccion.php

INSERT INTO `direccion` (`calle`, `numero`, `codigoPostal`, `municipio`, `estado`) VALUES ('Margatita Maza De Juarez', '12342512', '73800', 'San Juan', 'Puebla')
---
    public function insert2()
    {
        if (!$this->request->is('post')) {
            $this->index();
        }

        // Reglas de validación
        $rules = [
            'calle' => 'required',
            'numero' => 'required',
            'codigoPostal' => 'required',
            'municipio' => 'required',
            'estado' => 'required'
        ];
        $data = [
            'calle' => $_POST['calle'],
            'numero' => $_POST['numero'],
            'codigoPostal' => $_POST['codigoPostal'],
            'municipio' => $_POST['municipio'],
            'estado' => $_POST['estado']
        ];
        if (!$this->validate($rules)) {
            return view('head') .
                view('menu') .
                view('direccion/add2', [
                    'validation' => $this->validator
                ]) .
                view('footer');
        } else {
            $direccionM = model('DireccionM');
            $direccionM->insert($data);