app/Controllers/Imagen.php

    public function getFile($idImagen)
    {
        // Buscar el archivo por su ID en la base de datos
        $fileRecord = $this->ImagenM->find($idImagen);
---
SELECT *
FROM `imagen`
WHERE `imagen`.`idImagen` = '1'