app/Controllers/Paciente.php

SELECT *
FROM `paciente`
---
    public function index()
    {
        $session = session();
        if ($session->get('logged_in') != true || $session->get('tipo') != 0) {
            return redirect()->to(base_url('/usuario/salir')); // Llamar a la función salir
        }
        $pacienteM = model('PacienteM');
        $data['paciente'] = $pacienteM->findAll(); // Obtener todos los pacientes