app/Models/CitaUsuarioM.php

    public function getCitasPorUsuario($idUsuario)
    {
        return $this->db->table($this->table)
            ->select('
                cita.motivo,
                cita.fechaCita,
                cita.horaCita,
                doctor.nombreD as nombreDoctor,
                doctor.apellidoPD as apellidoPDoctor,
                doctor.apellidoMD as apellidoMDoctor,
                doctor.especialidad
            ')
            ->join('cita', 'cita.idCita = citaUsuario.idCita')
            ->join('consultorioDoctor', 'consultorioDoctor.id = cita.id')
            ->join('doctor', 'doctor.idDoctor = consultorioDoctor.idDoctor')
            ->where('citaUsuario.idUsuario', $idUsuario)
            ->where('citaUsuario.deleted_at IS NULL')
            ->get()
            ->getResult();
---
SELECT `cita`.`motivo`, `cita`.`fechaCita`, `cita`.`horaCita`, `cita`.`idCita`, `doctor`.`nombreD` as `nombreDoctor`, `doctor`.`apellidoPD` as `apellidoPDoctor`, `doctor`.`apellidoMD` as `apellidoMDoctor`, `doctor`.`especialidad`
FROM `citaUsuario`
JOIN `cita` ON `cita`.`idCita` = `citaUsuario`.`idCita`
JOIN `consultorioDoctor` ON `consultorioDoctor`.`id` = `cita`.`id`
JOIN `doctor` ON `doctor`.`idDoctor` = `consultorioDoctor`.`idDoctor`
WHERE `citaUsuario`.`idUsuario` = '2'
AND `citaUsuario`.`deleted_at` IS NULL