app/Models/ConsultorioM.php

SELECT `consultorio`.*, `imagen`.`nombreDelArchivo`, `imagen`.`idImagen`
FROM `consultorio`
LEFT JOIN `imagen` ON `imagen`.`idImagen` = `consultorio`.`idImagen`
WHERE `consultorio`.`idConsultorio` = '1'
 LIMIT 1
---
    public function getImagenConsultorio1($idConsultorio)
{
    return $this->select('consultorio.*, imagen.nombreDelArchivo, imagen.idImagen')
                ->join('imagen', 'imagen.idImagen = consultorio.idImagen', 'left')
                ->where('consultorio.idConsultorio', $idConsultorio)
                ->first();